# Reindex the below dataframe to a timeline between 2008 – 2017 and fill out the NaN values.

In [50]:
#Reindex the below dataframe to a timeline between 2008 – 2017 and fill out the NaN values.
import numpy as np
import pandas as pd
data = ({
            'Company A':[12,24,34,43,np.nan],
            'Company B':[13,np.nan,16,54,np.nan],
            'Company C':[np.nan,10,17,np.nan,3]
        })
index_data = np.arange(2008,2017,2)

dataset = pd.DataFrame(data, index = index_data)
print(dataset)

      Company A  Company B  Company C
2008       12.0       13.0        NaN
2010       24.0        NaN       10.0
2012       34.0       16.0       17.0
2014       43.0       54.0        NaN
2016        NaN        NaN        3.0

# 2. Consider the below Dataframe.
Now, I want to replace the NaN values in Col1 with the mean of values in Col2 if the value is greater than 5. Or else the NaN values should be set to 0. Can you code it for me?

In [4]:
#2. Consider the below Dataframe.
import pandas as pd
import numpy as np
df = pd.DataFrame({ 'Col1' : [1,np.NaN,3,np.NaN],
                    'Col2' : [8,9,7,10]
                  })
#print('Oiginal Data set ');print(df)
mean_col2 = df['Col2'].mean()
print();print(mean_col2)
if mean_col2 > 5:
    df['Col1'].fillna(mean_col2,inplace=True)
else:
    df['Col1'].fillna(0)
print('After modfiying the data set ');print(df)

8.5
After modfiying the data set
   Col1  Col2
0   1.0     8
1   8.5     9
2   3.0     7
3   8.5    10

In [71]:
#2. Consider the below Dataframe.
import pandas as pd
import numpy as np
df = pd.DataFrame({ 'Col1' : [1,np.NaN,3,np.NaN],
                    'Col2' : [8,9,7,10]
                  })
mean_col2 = df['Col2'].mean()
print(df)
#df['Col1'] = df['Col1'].apply(lambda x:x.fillna(mean_col2) if x>5 else 0)
#df['Col1'] =  list(map(lambda x : x.fillna(mean_col2) if x>5 else 0, df['Col1']))

    
#df1 = df.apply(lambda x: df['Col1'].fillna(mean_col2) if mean_col2 > 5 else df['Col1'].fillna(0), axis=1)
#df1 = df['Col1'].apply(lambda x: df['Col1'].fillna(mean_col2) if mean_col2 > 5 else df['Col1'].fillna(0))
df['Col1'] =  list(map(lambda x : x.fillna(mean_col2) if x > 0 else 0, df['Col1']))
df

   Col1  Col2
0   1.0     8
1   NaN     9
2   3.0     7
3   NaN    10

AttributeError: 'float' object has no attribute 'fillna'

In [49]:
import numpy as np
sample = pd.DataFrame({'var1':[10,100,40] })
print(sample)
sample['newvar1'] = sample.apply(lambda x: np.nan if x['var1'] < 90 else x['var1'], axis=1)
print(sample)

   var1
0    10
1   100
2    40
   var1  newvar1
0    10      NaN
1   100    100.0
2    40      NaN

In [72]:
import pandas as pd
import numpy as np
 
df = pd.DataFrame({
    'Hourly Rate': [20, 30, np.nan, 28, np.nan, 17, np.nan,22, 32],
    'Daily Rate': [72, 74,65,80, 74, np.nan, 67,82,75]}) 
df

   Hourly Rate  Daily Rate
0         20.0        72.0
1         30.0        74.0
2          NaN        65.0
3         28.0        80.0
4          NaN        74.0
5         17.0         NaN
6          NaN        67.0
7         22.0        82.0
8         32.0        75.0

In [75]:
df['Final Rate'] = np.where(df['Hourly Rate'].isnull(),df['Daily Rate'],df['Hourly Rate'])
df

   Hourly Rate  Daily Rate  Final Rate
0         20.0        72.0        20.0
1         30.0        74.0        30.0
2          NaN        65.0        65.0
3         28.0        80.0        28.0
4          NaN        74.0        74.0
5         17.0         NaN        17.0
6          NaN        67.0        67.0
7         22.0        82.0        22.0
8         32.0        75.0        32.0

# In the roedata.csv file, I want to replace all the Negative values in the ROE column reset to 0. How can I do it?

In [27]:
#In the roedata.csv file, I want to replace all the Negative values in the ROE column reset to 0. How can I do it?

In [7]:
import pandas as pd
local_path = 'C:\\Users\\Venkata Sai\\Desktop\\PYTHON\\UPX_LMS\\'
roe_dataset = pd.read_csv('attachment_roedata_lyst8606.csv')
print(roe_dataset.head())

type([roe_dataset['ROE']])

       Industry Name  Number of firms     ROE
0        Advertising               65  16.51%
1  Aerospace/Defense               95  21.60%
2      Air Transport               25  42.68%
3            Apparel               70  17.87%
4       Auto & Truck               26  22.05%

list

In [13]:
new_values = []
for value in roe_dataset['ROE']:
    if value.startswith('-') == True:
        new_values.append(0)
    else:
        new_values.append(value)
        
#delete the 'ROE' column
roe_dataset.drop(['ROE'],axis =1)   

#Add the 'ROE'column
roe_dataset['ROE'] = new_values

print(roe_dataset)

                          Industry Name  Number of firms      ROE
0                           Advertising               65   16.51%
1                     Aerospace/Defense               95   21.60%
2                         Air Transport               25   42.68%
3                               Apparel               70   17.87%
4                          Auto & Truck               26   22.05%
5                            Auto Parts               75   17.54%
6                                  Bank                7   15.03%
7                      Banks (Regional)              721    9.52%
8                             Beverage                47   27.62%
9                  Beverage (Alcoholic)               19   18.28%
10                        Biotechnology              349    6.77%
11                         Broadcasting               30   74.10%
12       Brokerage & Investment Banking               49    9.25%
13                   Building Materials               37    6.78%
14         Business & Consumer Services              179   12.48%
15                             Cable TV               16   26.62%
16                     Chemical (Basic)               47    8.80%
17               Chemical (Diversified)               10   24.33%
18                 Chemical (Specialty)              100   22.10%
19                Coal & Related Energy               45        0
20                    Computer Services              129   39.46%
21                    Computer Software              273   21.53%
22                Computers/Peripherals               66   24.55%
23                         Construction               18    3.62%
24                          Diversified               20   13.06%
25                 Educational Services               40        0
26                 Electrical Equipment              135   13.67%
27                          Electronics              191    7.98%
28      Electronics (Consumer & Office)               26   25.66%
29                          Engineering               56    7.61%
..                                  ...              ...      ...
67                             Railroad               10   19.85%
68            Real Estate (Development)               22        0
69    Real Estate (General/Diversified)               11    1.02%
70  Real Estate (Operations & Services)               47   19.84%
71                           Recreation               70   18.03%
72                          Reinsurance                3    6.05%
73                           Restaurant               84   27.46%
74                  Retail (Automotive)               30   30.79%
75             Retail (Building Supply)                7   23.12%
76                Retail (Distributors)               87   12.92%
77                     Retail (General)               21   17.68%
78            Retail (Grocery and Food)               21   10.91%
79                    Retail (Internet)               47   18.36%
80               Retail (Special Lines)              137   17.29%
81                        Rubber& Tires                4   45.41%
82                        Semiconductor              104   13.14%
83                  Semiconductor Equip               51        0
84                Shipbuilding & Marine               14    0.37%
85                                 Shoe               14   24.27%
86                                Steel               37        0
87                   Telecom (Wireless)               28        0
88                   Telecom. Equipment              131   15.67%
89                    Telecom. Services               82    5.78%
90                               Thrift              223        0
91                              Tobacco               12  214.71%
92                       Transportation               22   14.75%
93                             Trucking               28   16.01%
94                    Utility (General)               20    7.34%
95                      Utility (Water)               20    9.95%
96                         Total Market             7766   15.68%

[97 rows x 3 columns]

# In the below dataframe, replace all the NaN values in the First_name, last_name, age and sex using whichever method you find comfortable. Then fill in missing postTestScore values with each sex's mean value of postTestScore.

In [17]:
import pandas as pd
import numpy as np

data = ({
        'first_name':['Janson',np.nan,'Tina','Jake','Amy'],
        'last_name':['Miller',np.nan,'Ali','Milner','Cooze'],
        'age':[42,None,36,24,73],
        'sex':['m',np.nan,'f','m','f'],
        'preTestScore':[4,3,3,2,3],
        'postTestScore':[25,None,70,62,70],
        'locaiton':[np.nan,np.nan,np.nan,np.nan,np.nan]
})
df = pd.DataFrame(data)
df

  first_name last_name   age  sex  preTestScore  postTestScore  locaiton
0     Janson    Miller  42.0    m             4           25.0       NaN
1        NaN       NaN   NaN  NaN             3            NaN       NaN
2       Tina       Ali  36.0    f             3           70.0       NaN
3       Jake    Milner  24.0    m             2           62.0       NaN
4        Amy     Cooze  73.0    f             3           70.0       NaN

In [22]:
#replace all the NaN values in the First_name, last_name, age and sex using whichever method you find comfortable
# applying bfill() method to fill the missing values 


# replacing na values in college with No college 
df[['first_name','last_name','age','sex']].fillna(df[['first_name','last_name','age','sex']].bfill, inplace = True)

C:\Users\Venkata Sai\Anaconda3\lib\site-packages\pandas\core\frame.py:4034: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  downcast=downcast, **kwargs)

In [23]:
df

  first_name last_name   age  sex  preTestScore  postTestScore  locaiton
0     Janson    Miller  42.0    m             4           25.0       NaN
1        NaN       NaN   NaN  NaN             3            NaN       NaN
2       Tina       Ali  36.0    f             3           70.0       NaN
3       Jake    Milner  24.0    m             2           62.0       NaN
4        Amy     Cooze  73.0    f             3           70.0       NaN

In [26]:
df[['first_name','last_name','age','sex']].bfill(axis = 0)

  first_name last_name   age sex
0     Janson    Miller  42.0   m
1       Tina       Ali  36.0   f
2       Tina       Ali  36.0   f
3       Jake    Milner  24.0   m
4        Amy     Cooze  73.0   f

In [28]:
#fill in missing postTestScore values with each sex's mean value of postTestScore
df["postTestScore"].fillna(df.groupby("sex")["postTestScore"].transform("mean"), inplace=True)
df

  first_name last_name   age  sex  preTestScore  postTestScore  locaiton
0     Janson    Miller  42.0    m             4           25.0       NaN
1        NaN       NaN   NaN  NaN             3            NaN       NaN
2       Tina       Ali  36.0    f             3           70.0       NaN
3       Jake    Milner  24.0    m             2           62.0       NaN
4        Amy     Cooze  73.0    f             3           70.0       NaN

# 5. In the below dataframes, I want the NaN values in left dataframe to be replaced with those of right dataframe. How will you do it in a single line?

In [32]:
import pandas as pd
import numpy as np

dataset1 = pd.DataFrame([[np.nan,2],[3,np.nan]])
print();print(dataset1)

dataset2 = pd.DataFrame([[10,11],[12,13]])
print();print(dataset2)

# swapping two datasets without using temporary variable
dataset1, dataset2 = dataset2, dataset1

print();print(dataset1)
print();print(dataset2)

     0    1
0  NaN  2.0
1  3.0  NaN

    0   1
0  10  11
1  12  13

    0   1
0  10  11
1  12  13

     0    1
0  NaN  2.0
1  3.0  NaN

    0   1
0  10  11
1  12  13

     0    1
0  NaN  2.0
1  3.0  NaN